[{
  "title": "Behold the Oracle of War",
  "image_source": "",
  "author": "by Shawn Merwin",
  "text": "A new campaign is coming to the D&D Adventurers League, and you could find yourself in the middle of renewed hostilities among the nations of Khorvaire in Eberron! The campaign is called Oracle of War, and it officially launches in December 2019, soon after the release of Eberron: Rising from the Last War. Oracle of War is administered under the umbrella of the D&D Adventurers League, but is very different type of campaign from what has come before. The story presented in Oracle of War plays out in 20 Core Storyline adventures that take characters from level 1 to 20. After these 20 adventures are released, the campaign is set to conclude, the participants either changing the course of Eberron’s history, or falling victim to the machinations of villains diverse and deadly.\n\nCore Storyline adventures are placed on the DMs Guild at the rate of one per month, giving the campaign an active play period of approximately 2 years. At the end of that time, the Adventurers League admins will evaluate and makes plans for whatever comes next!\n\nIn addition to the Core Storyline adventures, the campaign offers 4 EPIC adventures, one for each tier of play. These EPIC adventures involve multiple tables playing at the same time in a story that highlights tangential plots within the main storyline, making them fun to play but not integral for those who may only wish to play the Core Storyline adventures. Other types of one-off or tangential special adventures may be offered over the course of the two-year campaign, but the Core Storyline adventures are the crux of the campaign.\n\nThe Oracle of War Player’s Guide and Oracle of War DM’s Guide will be available at the end of October 2019. More details about the campaign, character creation rules, and other details are contained in these guides."

},
  {
  "title": "Cleric, Druid and Wizard",
  "image_source": "",
  "author": "by Dan Dillon",
  "text": "Three classes each receive a playtest option this week. The cleric receives a new Divine Domain option: the Twilight Domain. The druid gains a new Druid Circle option: the Circle of Wildfire. And the wizard gains a new Arcane Tradition feature: Onomancy, the magic of true names. We invite you to give these subclasses a look, try them in play, and let us know what you think in an upcoming survey on this website. The material in Unearthed Arcana is presented for playtesting and to spark your imagination. These game mechanics are in draft form, usable in your D&D campaign but not refined by final game design. They are not officially part of the game. For these reasons, material in this column is not legal in D&D Adventurers League events."

  }
]