[{"name": "Behold the Oracle of War", "image_source": "", "author": "by Shawn Merwin", "text": "A new campaign is coming to the D&D Adventurers League, and you could find yourself in the middle of renewed hostilities among the nations of Khorvaire in Eberron! The campaign is called Oracle of War, and it officially launches in December 2019, soon after the release of Eberron: Rising from the Last War. Oracle of War is administered under the umbrella of the D&D Adventurers League, but is very different type of campaign from what has come before. The story presented in Oracle of War plays out in 20 Core Storyline adventures that take characters from level 1 to 20. After these 20 adventures are released, the campaign is set to conclude, the participants either changing the course of Eberron’s history, or falling victim to the machinations of villains diverse and deadly. Core Storyline adventures are placed on the DMs Guild at the rate of one per month, giving the campaign an active play period of approximately 2 years. At the end of that time, the Adventurers League admins will evaluate and makes plans for whatever comes next! In addition to the Core Storyline adventures, the campaign offers 4 EPIC adventures, one for each tier of play. These EPIC adventures involve multiple tables playing at the same time in a story that highlights tangential plots within the main storyline, making them fun to play but not integral for those who may only wish to play the Core Storyline adventures. Other types of one-off or tangential special adventures may be offered over the course of the two-year campaign, but the Core Storyline adventures are the crux of the campaign. The Oracle of War Player’s Guide and Oracle of War DM’s Guide will be available at the end of October 2019. More details about the campaign, character creation rules, and other details are contained in these guides.", "url": "behold_the_oracle_of_war"}, {"name": "Cleric, Druid and Wizard", "image_source": "", "author": "by Dan Dillon", "text": "Three classes each receive a playtest option this week. The cleric receives a new Divine Domain option: the Twilight Domain. The druid gains a new Druid Circle option: the Circle of Wildfire. And the wizard gains a new Arcane Tradition feature: Onomancy, the magic of true names. We invite you to give these subclasses a look, try them in play, and let us know what you think in an upcoming survey on this website. The material in Unearthed Arcana is presented for playtesting and to spark your imagination. These game mechanics are in draft form, usable in your D&D campaign but not refined by final game design. They are not officially part of the game. For these reasons, material in this column is not legal in D&D Adventurers League events.", "url": "cleric"}, {"name": "Bard and Paladin", "image_source": "", "author": "by Ari Levitch", "text": "Two classes, the bard and the paladin, discover new playtest possibilities this week. The bard receives a new Bardic College feature: the College of Eloquence. Additionally, the paladin gains a new Sacred Oath feature: the Oath of Heroism.The material in Unearthed Arcana is presented for playtesting and to spark your imagination. These game mechanics are in draft form, usable in your D&D campaign but not refined by final game design. They are not officially part of the game. For these reasons, material in this column is not legal in D&D Adventurers League events.", "url": "bard"}, {"name": "Nightmare Treasure: Wand of Wild Candy", "image_source": "", "author": "by Dan Telfer", "text": "Hey adventurers! I see my position as resident Comedy Archmage as not just an opportunity for butt jokes, but as a chance to create extremely strange catalysts that you can drop into your own games of D&D and hopefully create a little bit of comedy for you and your friends. Some of you might read that and think, “please keep your strange catalysts off of my table!” Maybe your table is a nice expensive wood one, so I understand. But to the rest of you, welcome to some Halloween-inspired stupidity! I'm all for occasional stupidity (and silliness). I’m a big fan of Wild Magic. On my podcast Nerd Poker, I made my own Wild Magic effects table for player Blaine Capatch’s druid character, so that every time he communes with nature there is a chance something utterly chaotic will happen. It's not your typical surge, it's extra... nerdy. Also Blaine is a comedy madman, and enjoys courting chaos. Equally wild and messed up is the Wand of Wild Candy. Made from a shiny black twig that evokes black licorice (the divisive cilantro of the candy world), it contains 6 charges and you must be attuned to use it. Each wave of the wand causes a different candy to appear, and the type of candy summoned is dependent on a d20 roll. All candy appears cute and innocuous, but ingesting it will cause strange and potentially disturbing effects. See the below table to discover which! All effects last 2 hours, summon 2 of the specified candy per cast, and all candy fits in the palm of a humanoid adult’s hand unless otherwise stated. In my opinion immunities to charm spells should go out the window- they ate this magic and it lives inside them like an apple from a stranger. But hey, maybe I'm a jerk. I think this works best if players have no idea what the candy is going to do. Some effects are best left as unknowns to the players, as all hell can break loose. This can be especially useful to employ mid-combat or right before engaging an enemy, so that a player can be told to just point their various body parts at enemies and cross their potentially cursed fingers as the Wild Magic happens. Perhaps players should tread no further, and merely pass this along to your DM if it sounds interesting. Or you know, be the only one in the party who reads it and then pass it along. The candy itself can be stashed in a pocket for use later, though impulsive consumption is encouraged, particularly because it’s the holidays and those calories don’t actually count. When all charges have been used up, the Wild Candy Wand explodes in a harmless cloud of bright orange sugar dust that tastes eerily like the contents of our world’s Pixie Stix. Eating this dust has no ill effects! However, you have to kinda run around in the cloud with your tongue out, or scrape some off the ground as it settles, so you’ll look kinda weird. Live with that truth. Happy Halloween.", "url": "nightmare"}, {"name": "Encounter of the Week: The Watchers ", "image_source": "", "author": "by Ashley Warren", "text": "Stoneheart Tower looms on a rocky cliff, its spire piercing the veil of mist that hangs overhead. What was once a place where powerful folk studied and plotted is now a dark, empty shell that lies in ruins. Grouting the crumbling stone bricks is a black corruption that corrodes the tower, sprouted from whatever rots inside. At the sight of adventurers emerging from the forest, three gargoyles perched on the battlements begin to move, wings creaking from decades in stasis. This week’s encounter is called The Watchers, in which the characters encounter beings who are more than meets the eye. A century ago, three adventurers sought out an arcane tower based on rumors that it contained riches, among them a priceless artifact: a mirror that would grant the keeper their deepest desire. The tower was once a place of study for wayward mages to experiment and craft magical items, but it was abandoned long ago. Not long after, the tower was found by a medusa. She ransacked the tower and discovered Abyssal magic that could enhance her already formidable powers. She corrupted the magic mirror with this magic, so that any who saw their own visage within it would see hers instead, petrifying them. In need of test subjects, the medusa kindled the rumor to draw unsuspecting travelers to the tower. It worked, and the three adventurers were unwittingly transformed into gargoyles. Years later, the medusa is long gone and her mirror lies abandoned in an empty tower. Its cracked surface emits a dark corruption that has begun to spread throughout the spire. The gargoyles guard Stoneheart Tower, preventing others from suffering the same fate, and do whatever they can to deter adventurers.", "url": "watchers"}, {"name": "Cleric 101: Knowledge Domain", "image_source": "", "author": "by James Haeck", "text": "Class is back in session. This week, we shall drink deep of the Holy Water of Oghma, in order to discover the mystical secrets of the Knowledge Domain. Clerics who follow gods of knowledge such as Azuth and Oghma of the Forgotten Realms, gods of secrets and mystery like Vecna of Greyhawk, or even gods of craft such as Reorx of Krynn. Even gods who pursue knowledge as a means to an end, such as the gods of magic Mystra of the Forgotten Realms and Boccob and Wee Jas of Greyhawk, have been known to grant their clerics access to the Knowledge Domain. Unfurl your parchment, pop open your inkwells, and put on your thinking caps. It’s time to learn about the divine domain of Knowledge. We’ve completed our first full rotation of the twelve classes, and exhausted all the content that the Basic Rules have to offer—as far as classes go, that is. This next wave of the Class 101 series will appraise every subclass within the Player’s Handbook and break down each subclass’s strengths, weaknesses, thematic elements, and everything else a player would want to know before playing that subclass. Because of this, you will need to own the Player’s Handbook (or purchase the subclass a la carte on the Marketplace) in order to make full use of this series.", "url": "domain"}, {"name": "Bard 101: College of Valor", "image_source": "", "author": "by James Haeck", "text": "Class is back in session, and now we return to the bard class. This week, it’s time to learn about the College of Valor, a bard that sings songs of heroes of ages past and fights on to create new legends in the present. Like warrior-poets and Viking skalds of old, your verses inspire your comrades towards dizzying heights of glory and martial prowess. We’ve completed our first full rotation of the twelve classes, and exhausted all the content that the Basic Rules have to offer—as far as classes go, that is. This next wave of the Class 101 series will appraise every subclass within the Player’s Handbook and break down each subclass’s strengths, weaknesses, thematic elements, and everything else a player would want to know before playing that subclass. Because of this, you will need to own the Player’s Handbook (or purchase the subclass a la carte on the Marketplace) in order to make full use of this series.", "url": "valor"}, {"name": "How to Play a Yugoloth the Ultimate Mercenary", "image_source": "", "author": "by James Haeck", "text": "The Blood War consumes the Lower Planes. It exists in the back of every fiend’s mind—save for those so tormented that rational thought is beyond them, such as manes and lemures. So far, this series has given advice on how to play the creatures serving on either side of the Blood War: devils fighting for tyrannical order and the stability of the Nine Hells, and demons fighting for utter chaos and the endless hunger of the Abyss. There are fiends that exist outside of this dichotomy of law versus chaos. Some of these neutral fiends defy classification, such as succubi and incubi, hell hounds , and nightmares. These fiends often have some sort of loose allegiance (such as incubi to the Demon Lord Graz’zt and nightmares to their devilish narzugon riders, but there are fiends that exist outside of the hierarchies of demons and devils entirely. These fiends, called yugoloths, are denizens of the Bleak Eternity of Gehenna, a lower plane aligned to the cosmic forces of neutrality and evil. Souls that act selfishly, greedily, cruelly, or that commit purposelessly evil acts are often consigned to an afterlife in Gehenna. These souls become yugoloths. Like demons and devils, yugoloths take many forms, which reflect the powers their evil spirits have developed in their new lives. Legend says that the yugoloths were first created by a sisterhood of night hags, and that these hags were commissioned by Asmodeus to create an army of fiends that could fight eternally within the Nine Hells. The story of the yugoloths and their creation is told in greater detail in their entry in the Monster Manual. As the yugoloth civilization grew and spread across Gehenna, it eventually began to spread across other planes, and now the planes of Gehenna, Carceri, Hades, and Acheron exist under at least partial yugoloth hegemony. As they spread across the multiverse, conquering as they went, yugoloths began to be approached by mortals and extraplanar beings alike who sought their martial talents. Over the eons, since the first contract was forged with a yugoloth warlord, these neutral evil fiends have earned a reputation as the finest mercenaries in the multiverse. Yugoloth mercenaries are expensive beyond most mortals’ imagining, and they are self-serving to a fault. They lack both the extreme unpredictability of demonic hordes and the strict orderliness of diabolical legions. In a phrase, yugoloths are selfishness embodied.", "url": "mercenary"}]